Revit 2024 API
ParameterTypeId.EnergyAnalysisGlazingIsShaded Property
 "Glazing is Shaded"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId EnergyAnalysisGlazingIsShaded { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisGlazingIsShaded As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisGlazingIsShaded {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace